#include <stdio.h>                  // подключаем заголовочный файл stdio.h
int main(void)                      // определяем функцию main
{                                   // начало функции
    printf("Let's\n");              // выводим 1 строку на консоль
    printf("  go\n");               // выводим 2 строку на консоль
    printf("    to walk\n");        // выводим 3 строку на консоль
    return 0;                       // выходим из функции
}                                   // конец функции/*
