#include <stdio.h>                  // подключаем заголовочный файл stdio.h
int main(void)                      // определяем функцию main
{                                   // начало функции
    printf("   *\n");               // выводим 1 строку на консоль
    printf("  ***\n");              // выводим 2 строку на консоль
    printf(" *****\n");             // выводим 3 строку на консоль
    printf("*******\n");            // выводим 3 строку на консоль
    printf(" HHOHH\n");             // выводим 3 строку на консоль
    printf(" ZZZZZ\n");             // выводим 3 строку на консоль
    return 0;                       // выходим из функции
}                                   // конец функции/*
